# arara -- the cool TeX automation tool
# Copyright (c) 2012, Paulo Roberto Massa Cereda
# All rights reserved.
#
# Redistribution and  use in source  and binary forms, with  or without
# modification, are  permitted provided  that the  following conditions
# are met:
#
# 1. Redistributions  of source  code must  retain the  above copyright
# notice, this list of conditions and the following disclaimer.
#
# 2. Redistributions in binary form  must reproduce the above copyright
# notice, this list  of conditions and the following  disclaimer in the
# documentation and/or other materials provided with the distribution.
#
# 3. Neither  the name  of the  project's author nor  the names  of its
# contributors may be used to  endorse or promote products derived from
# this software without specific prior written permission.
#
# THIS SOFTWARE IS  PROVIDED BY THE COPYRIGHT  HOLDERS AND CONTRIBUTORS
# "AS IS"  AND ANY  EXPRESS OR IMPLIED  WARRANTIES, INCLUDING,  BUT NOT
# LIMITED  TO, THE  IMPLIED WARRANTIES  OF MERCHANTABILITY  AND FITNESS
# FOR  A PARTICULAR  PURPOSE  ARE  DISCLAIMED. IN  NO  EVENT SHALL  THE
# COPYRIGHT HOLDER OR CONTRIBUTORS BE  LIABLE FOR ANY DIRECT, INDIRECT,
# INCIDENTAL, SPECIAL, EXEMPLARY,  OR CONSEQUENTIAL DAMAGES (INCLUDING,
# BUT  NOT LIMITED  TO, PROCUREMENT  OF SUBSTITUTE  GOODS OR  SERVICES;
# LOSS  OF USE,  DATA, OR  PROFITS; OR  BUSINESS INTERRUPTION)  HOWEVER
# CAUSED AND  ON ANY THEORY  OF LIABILITY, WHETHER IN  CONTRACT, STRICT
# LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY
# WAY  OUT  OF  THE USE  OF  THIS  SOFTWARE,  EVEN  IF ADVISED  OF  THE
# POSSIBILITY OF SUCH DAMAGE.
#
# Messages_tr: This file holds the Turkish language messages for arara.
#
# translated by: Brent Longborough (Obviously not a fluent Turkish speaker!)
# e-mail: brent@longborough.org
Log_WelcomeMessage = Arara Ho\u015fgeldiniz
Log_ProcessingFile = \u0130\u015flem dosyas\u0131 ''{0}'', l\u00fctfen bekleyiniz.
Log_Done = Haz\u0131r.
Log_ExceptionRaised = Arara a\u015fa\u011f\u0131daki mesajla istisna kald\u0131rd\u0131:
Log_ReadyToRunCommands = Komutlar\u0131 \u00e7al\u0131\u015ft\u0131rmak haz\u0131r.
Log_CommandName = Running ''{0}'' \u00e7al\u0131\u015ft\u0131rma.
Log_Command = Komut: {0}
Log_CommandSuccess = ''{0}'' ba\u015far\u0131yla \u00e7al\u0131\u015ft\u0131r\u0131ld\u0131.
Log_CommandFailure = ''{0}'' hata durumu d\u00f6nd\u00fcrd\u00fc.
Log_AllCommandsSuccess = T\u00fcm komutlar\u0131 ba\u015far\u0131yla idam edildi.
Log_OutputLogging = \u00c7\u0131kt\u0131 g\u00fcnl\u00fc\u011f\u00fc:
Log_CommandNotFound = ''{0}'' was not found in the path. Execution attempt: {1}
Log_DirectiveFound = Y\u00f6nergesi {1} ile uyumlu {0}''de bulunan.
Log_RuleFound = G\u00f6rev ''{0}'' ''{1}''\u0131nda bulundu.
Help_Version = uygulama s\u00fcr\u00fcm\u00fc yazd\u0131rmak
Help_Help = yard\u0131m mesaj\u0131 yazd\u0131rmak
Help_Log = g\u00fcnl\u00fc\u011f\u00fc \u00e7\u0131kt\u0131 \u00fcretmek
Help_Verbose = komut \u00e7\u0131kt\u0131s\u0131 yazd\u0131rmak
Help_Timeout = y\u00fcr\u00fctme zaman a\u015f\u0131m\u0131 (milisaniye) ayarlamak
Help_Language = uygulama dili ayarlamak

Header_Slogan = Serin TeX otomasyon arac\u0131
Header_AllRightsReserved = T\u00fcm haklar\u0131 sakl\u0131d\u0131r.

Msg_SpecialThanks = \u00d6zel te\u015fekk\u00fcrler bunlar i\u00e7in: Alan Munn, Andrew Stacey, Brent Longborough, Clemens Niederberger, David Carlisle, Enrico Gregorio, Francesco Endrici, Gonzalo Medina, Harish Kumar, Joseph Wright, Marco Daniel Patrick Gundlach, Rasmus Roulund, Stefan Kottwitz, ve di\u011ferleri gitmek m\u00fcmk\u00fcn m\u00fctevaz\u0131 bir ara\u00e7.
Msg_RunningCommand = {0} \u00e7al\u0131\u015ft\u0131rma...
Msg_Success = BA\u015eARI
Msg_Failure = ARIZASI
Msg_Status = Durum:

YamlError_Context = Ba\u011flam: {0}
YamlError_Problem = Sorun: {0}
YamlError_ErrorLocation = Hata uyumlu {0}''de, s\u00fctunu {1} bulundu.

Error_FileDoesNotExistWithExtensionsList = \u00dczg\u00fcn\u00fcm, ancak dosya ''{0} {1}'' yok. Sadece uzant\u0131s\u0131 olmadan dosya ad\u0131n\u0131 veya bilinmeyen bir uzant\u0131 ile sa\u011flad\u0131\u011f\u0131n\u0131zda, arara bu s\u0131rayla \u00f6nceden uzant\u0131lar\u0131 {1} ile biten dosyalar\u0131 aramak i\u00e7in \u00e7al\u0131\u015faca\u011f\u0131z. Siz d\u00fczeni veya arama deseni, ge\u00e7ersiz k\u0131labilirsiniz, veya hatta yeni uzant\u0131lar i\u00e7in destek ekleyebilirsiniz. Bu \u00f6zellik hakk\u0131nda daha fazla bilgi edinmek i\u00e7in arara k\u0131lavuzuna bak\u0131n\u0131z.

Error_FileDoesNotExist = Dosya ''{0}'' yok.

Error_CommandNotFound = \u00dczg\u00fcn\u00fcm, ama ''{0}'' g\u00f6revden komutu bulunamad\u0131. Komut ''{1}'' do\u011fru veya sistem yolu bile eri\u015filebilir oldu\u011fundan emin misiniz?

Error_InvalidYAMLConfigurationFile = \u00dczg\u00fcn\u00fcm, ama g\u00f6r\u00fcn\u00fc\u015fe g\u00f6re sizin arara yap\u0131land\u0131rma dosyas\u0131 ge\u00e7ersiz oldu\u011funu, ge\u00e7ersiz veya eksik YAML giri\u015fleri vard\u0131r. Hata giderilene kadar maalesef arara devam edemiyor. Ben hata iletisi d\u00f6k\u00fcm\u00fc i\u00e7in elimden geleni yapt\u0131m, bu y\u00fczden burada:

Error_InvalidConfigurationFile = Uh-oh, yap\u0131land\u0131rma dosyas\u0131 ge\u00e7ersiz g\u00f6r\u00fcn\u00fcyor. E\u011fer uygun bir YAML dosyas\u0131 oldu\u011fundan emin misiniz? Uygun bir yap\u0131land\u0131rma dosyas\u0131 girilene kadar maalesef arara devam edemiyor.

Error_InvalidLanguageConfigurationFile = Houston, bir sorunumuz var. Ne yaz\u0131k ki, yap\u0131land\u0131rma dosyas\u0131nda ayarlanan dil ge\u00e7erli de\u011fil. \u015eu anda, arara \u015fu dilleri destekler: {0}. Ge\u00e7erli bir dil se\u00e7in ya da yap\u0131land\u0131rma dosyas\u0131 (alan iste\u011fe ba\u011fl\u0131d\u0131r), giri\u015fi kald\u0131rmak i\u00e7in emin olun, aksi takdirde arara devam edemiyor.

Error_InvalidFiletypesConfigurationFile = \u00dczg\u00fcn\u00fcm, ama bu yap\u0131land\u0131rma dosyan\u0131zda tan\u0131ml\u0131 uzant\u0131s\u0131 ne desen ne ile filetypes \u00f6zelle\u015ftirilmi\u015f gibi g\u00f6r\u00fcn\u00fcyor. Hem devam edebilmesi i\u00e7in gereklidir. Yap\u0131land\u0131rma dosyas\u0131nda bu hatay\u0131 d\u00fczeltiniz, ve tekrar deneyiniz.

Error_PathRuntimeErrorConfigurationFile = \u00dczg\u00fcn\u00fcm, ancak yap\u0131land\u0131rma dosyas\u0131nda arama yoluna girdilerinden birini yolunu ba\u011flam\u0131nda kullan\u0131lamayan bir de\u011fi\u015fken vard\u0131r: ''{0}''

Error_PathIOErrorConfigurationFile = \u00dczg\u00fcn\u00fcm, ancak yap\u0131land\u0131rma dosyas\u0131nda arama yoluna girdilerinden birini hatal\u0131 bi\u00e7imlendirilmi\u015f bir dizin yap\u0131s\u0131 vard\u0131r. E\u011fer ona bir g\u00f6z atabilir misiniz?

Error_InvalidYAMLDirective = Bu \u00e7izgi {0}, yani bir YAML s\u00f6zdizimi hatas\u0131 veya ge\u00e7ersiz bir alan olabilir bir direktif bulunan bozuk bir direktifi var g\u00f6r\u00fcn\u00fcr. Ben hata iletisi d\u00f6k\u00fcm\u00fc i\u00e7in elimden geleni yapt\u0131m, bu y\u00fczden burada:

Error_DirectiveEmptyCurlyBrackets = \u00c7izgi {1} \u00fczerine ''{0}'' direktifi bo\u015f k\u00fcme parantezleri vard\u0131r. Bir direktif herhangi bir parametre varsa arara temiz bir s\u00f6zdizimi i\u00e7in se\u00e7mesi. Bunu d\u00fczeltmek i\u00e7in, ya s\u00fcsl\u00fc parantez kald\u0131rmak veya y\u00f6nergesi i\u00e7in arg\u00fcmanlar sunmak i\u00e7in yeterli.

Error_DirectiveInvalidArgumentList = \u00c7izgi {1} \u00fczerinde ''{0}'' direktifi ge\u00e7ersiz bir arg\u00fcman t\u00fcr\u00fc vard\u0131r. Arg\u00fcman\u0131 ''{2}'' ayr\u0131lm\u0131\u015f bir arara anahtar kelime ve her zaman bir liste gerektirir. 

Error_DirectiveReservedKeyword = \u00c7izgi {1} direktifi ''{0}'' arg\u00fcman ge\u00e7ersiz bir ad\u0131 vard\u0131r. Ad\u0131 ''{2}'' ''{3}'' listesinde her elementi temsil eden bir arara ayr\u0131lm\u0131\u015f anahtar s\u00f6zc\u00fck vard\u0131r. Bu arg\u00fcman i\u00e7in ba\u015fka bir ad\u0131 se\u00e7iniz, l\u00fctfen.

Error_DirectiveListError = \u00c7izgi {1} Direktifi ''{0}'' arg\u00fcman ge\u00e7ersiz bir t\u00fcrde. Sadece arg\u00fcmanlar\u0131 ''file'' ve ''items'' bir liste olabilir. Hem arara anahtar sakl\u0131d\u0131r.

Error_DirectiveGenericError = Directive ''{0}'' at line {1} seems to be malformed. It might be a YAML syntax error or a wrong mapping. \u00c7izgi {1} direktifi ''{0}'' hatal\u0131 gibi g\u00f6r\u00fcn\u00fcyor. Bir YAML s\u00f6zdizimi hatas\u0131 veya yanl\u0131\u015f bir e\u015fleme olabilir.

Error_InvalidLanguage = \u00dczg\u00fcn\u00fcm, ama se\u00e7ti\u011finiz dil kodu ge\u00e7ersiz. \u015eu anda a\u015fa\u011f\u0131daki dillerde desteklenmektedir:

Error_RuleNotFound = Uh-oh, arama yolunda ''{0}'' kural\u0131 bulamad\u0131. Kural arama yolu \u00fczerinden eri\u015filebilir ise kural ad\u0131n\u0131n do\u011fru oldu\u011funu ve e\u011fer bir bakabilir misiniz?

Error_InvalidYAMLRule = Bu ''{0}'' g\u00f6revi bir YAML s\u00f6zdizimi hatas\u0131 veya ge\u00e7ersiz bir alan var gibi g\u00f6r\u00fcn\u00fcyor. E\u011fer ''{1}'' yer ''{0}.yaml'' dosyas\u0131na bir g\u00f6z s\u00fcrebilir. Ben hata iletisi d\u00f6k\u00fcm\u00fc i\u00e7in elimden geleni yapt\u0131m, bu y\u00fczden burada:

Error_InvalidRule = Uh-oh, ''{0}'' g\u00f6revi ge\u00e7ersiz g\u00f6r\u00fcn\u00fcyor. E\u011fer ''{1}'' de bulunan ''{0}.yaml'' uygun bir YAML dosyas\u0131 oldu\u011fundan emin misiniz?

Error_EmptyIdentifierRule = Bir sorun ''{0}'' g\u00f6revi saptand\u0131. ''{1}'' yer ''{0}.yaml'' dosyas\u0131 ge\u00e7erli bir tan\u0131mlay\u0131c\u0131 gerektirir. Bunu d\u00fczeltebilir misiniz?

Error_EmptyNameRule = Bir sorun ''{0}'' g\u00f6revi saptand\u0131. ''{1}'' yer ''{0}.yaml'' dosyas\u0131 ge\u00e7erli bir isim gerektirir. Bunu d\u00fczeltebilir misiniz?

Error_ForbiddenIdentifierRule = Uh-oh, ''{0}'' g\u00f6revi (''{1}'' yer ''{0}.yaml'' dosyas\u0131 ba\u015fvuran) ge\u00e7ersiz bir arg\u00fcman tan\u0131mlay\u0131c\u0131s\u0131 vard\u0131r. ''{2}'' ayr\u0131lm\u0131\u015f bir anahtar kelime, bu nedenle kullan\u0131lamaz. E\u011fer ba\u015fka bir isim kullanabilir misiniz?

Error_EmptyArgumentsListRule = Bir sorun ''{0}'' g\u00f6revi saptand\u0131. ''{1}'' yer ''{0}.yaml'' dosyas\u0131 arg\u00fcmanlar ge\u00e7erli bir liste gerektirir. Bunu d\u00fczeltebilir misiniz? Arg\u00fcmanlar listesi de bo\u015f olabilir, ama onunla a\u00e7\u0131k\u00e7a definie i\u00e7in hala gerekli oldu\u011funu unutmay\u0131n ''arguments: []''.

Error_WrongIdentifierRule = Uh-oh, ''{0}'' g\u00f6revi (''{1}'' yer ''{0}.yaml'' dosyas\u0131 ba\u015fvuran) yanl\u0131\u015f bir tan\u0131mlay\u0131c\u0131s\u0131 vard\u0131r - ''{0}}'' yerine ''{2}'' bekleniyordu. Bunu d\u00fczeltebilir misiniz?

Error_ArgumentsNotDefinedInRule = Direktifi ''{0}'', ''{1}'' yer ''{0}.yaml'' kural\u0131 taraf\u0131ndan tan\u0131mlanan verilmez arg\u00fcmanlar\u0131 kullan\u0131r. Ya ''{0}'' directifi bunlar\u0131 kald\u0131rmak veya ''{0}.yaml'' kural\u0131 arg\u00fcman listesine ekleyebilirsiniz. \u0130\u015fte onlar: {2}

Error_DefaultValueRuntimeErrorRule = \u00dczg\u00fcn\u00fcm, arg\u00fcman ''{1}'' g\u00f6revi (''{2}'' yer ''{1}.yaml'' dosyas\u0131 ba\u015fvuran) ve ''{0}'' i\u00e7in ayarlanm\u0131\u015f varsay\u0131lan de\u011fer kural\u0131 ba\u011flam\u0131nda kullan\u0131lamayan bir de\u011fi\u015fken / y\u00f6ntemi vard\u0131r: ''{3}''

Error_FlagRuntimeErrorRule = \u00dczg\u00fcn\u00fcm, ama ''{1}'' g\u00f6revi (''{2}'' yer ''{1}.yaml'' dosyas\u0131 ba\u015fvuran) aras\u0131nda arg\u00fcman\u0131 ''{0}'' i\u00e7in belirlenen bayrak kural\u0131 ba\u011flam\u0131nda kullan\u0131lamayan bir de\u011fi\u015fken / y\u00f6ntemi vard\u0131r: ''{3}''

Error_DuplicatedCommandElementsRule = Uh-oh, both ''command'' and ''commands'' fields are set in the ''{0}'' task (referencing the ''{0}.yaml'' file located at ''{1}''). You need to pick only one of them. If your task only relies on a single command, you can opt for ''command''; if your rule requires a set of commands, maybe the ''commands'' field is more suitable.

Error_MissingCommandElementsRule = Uh-oh, ''{0}'' g\u00f6revi (''{1}'' yer ''{0}.yaml'' dosyaya ba\u015fvuran) ya 'command' veya 'commands' \u00f6\u011feleri yok. Siz sadece bir tanesi almak gerekir. G\u00f6reviniz sadece tek bir komut dayan\u0131yor ise, 'command' tercih edebilirsiniz; kural\u0131n\u0131z komutlar\u0131 bir dizi gerektiriyorsa, belki 'commands' alan\u0131na daha uygundur.

Error_CommandRuntimeErrorRule = \u00dczg\u00fcn\u00fcm, ama ''{0}'' g\u00f6revi (''{1}'' yer ''{0}.yaml'' dosyas\u0131 ba\u015fvuran) i\u00e7in komut k\u00fcmesini kural\u0131 ba\u011flam\u0131nda kullan\u0131lamayan bir de\u011fi\u015fken / y\u00f6ntemi vard\u0131r: ''{2}''
